{
  "RootMetadata": {
    "title": "Алексей - frontend-разработчик: React, Next.js | Создание современных веб-приложений",
    "description": "Я опытный frontend-разработчик с глубоким знанием React, Next.js, Tailwind и TypeScript. Создаю адаптивные, анимированные веб-приложения с упором на производительность, UX/UI и SEO.",
    "keywords": "frontend-разработчик, React разработчик, Next.js разработчик, Tailwind CSS, TypeScript, GSAP, Motion, адаптивный дизайн, веб-анимации, SEO, Zustand, Zod, разработка веб-приложений, оптимизация сайта, современный UX/UI",
    "ogTitle": "Алексей - frontend-разработчик | React, Next.js, TypeScript",
    "ogDescription": "Я frontend-разработчик с опытом работы с React, Next.js, Tailwind и TypeScript. Создаю адаптивные и анимированные веб-приложения с упором на производительность, современный дизайн и SEO."
  },
  "TodoListMetadata": {
    "title": "Todo List — Управление задачами: Удобный список дел с адаптивным дизайном",
    "description": "Организуйте свои задачи с помощью удобного Todo List. Функции: добавление, редактирование, удаление задач, фильтры и адаптивный дизайн. Разработано с использованием React, TypeScript и Tailwind для быстроты и функциональности.",
    "keywords": "todo list, список задач, управление задачами, приложение для дел, React todo, TypeScript todo, адаптивный список дел, современный дизайн, список дел с фильтрацией, простое управление задачами",
    "ogTitle": "Todo List — Удобный инструмент для управления задачами",
    "ogDescription": "Todo List для организации повседневных задач. Современный интерфейс, фильтры и управление в реальном времени. Построено на React и TypeScript с использованием адаптивного дизайна."
  },
  "Header": {
    "navLinks": {
      "main": "Главная",
      "todo": "ToDo List",
      "weather": "Погода"
    },
    "themeSwitcher": {
      "ariaLabel": "Переключить тему"
    },
    "languageSwitcher": {
      "ariaLabel": "Переключить язык"
    }
  },
  "Footer": {
    "main": "Главная",
    "todo": "ToDo List",
    "privacy": "© Все права защищены. {currentYear}"
  },
  "HomePage": {
    "mainScreen": {
      "title": "разработчик",
      "stack": "Стек",
      "text": "Привет! Меня зовут Алексей, у меня есть опыт работы с React, Next.js и TypeScript. Специализируюсь на создании адаптивных, SEO-оптимизированных интерфейсов, уделяя особое внимание производительности и удобству пользователей.",
      "buttons": {
        "button1": "Скачать резюме",
        "button2": "Связаться со мной"
      },
      "imageAlt": "Персональная фотография Алексея, веб-разработчика"
    },
    "about": {
      "title": "Обо мне",
      "text1": "Я разрабатываю веб-приложения с использованием фреймворка Next.js и технологий стилизации, таких как Tailwind CSS, SCSS и CSS Modules, создавая решения, которые легко масштабируются и адаптируются под различные устройства.",
      "text2": "В своей работе я также применяю Docker для развертывания и управления проектами, что позволяет обеспечить стабильность и гибкость инфраструктуры. Я открыт к новым вызовам и всегда готов расширять свои знания. Постоянно ищу способы оптимизации процессов и улучшения взаимодействия с пользователем, чтобы создавать максимально эффективные и удобные решения."
    },
    "stack": {
      "title": "Стек технологий",
      "text": "Пишу понятный, лаконичный, надежный код, который работает. Свободно ориентируюсь в технической документации на английском языке.",
      "technologyList": {
        "web": {
          "title": "Технологии:",
          "technologies": "HTML, CSS, SCSS, Tailwind, React, Next.js, TypeScript."
        },
        "lib": {
          "title": "Библиотеки:",
          "technologies": "Zustand, React Hook Form, Zod, React Modal, Embla Carousel, Next Intl."
        },
        "animation": {
          "title": "Анимации:",
          "technologies": "GSAP, Motion, Lenis Scroll"
        },
        "tools": {
          "title": "Инструменты:",
          "technologies": "Git, Docker, Figma, Photoshop"
        }
      }
    },
    "projects": {
      "title": "проекты",
      "projectList": {
        "project1": {
          "title": "Cайт для веб-студии",
          "description": "Сайт разработан с использованием Next.js, LenisScroll для плавной прокрутки и GSAP для анимаций от скролла. В проекте также внедрены React Hook Form и Yup для валидации форм, отправка данных на E-mail / Telegram реализована на Express."
        },
        "project2": {
          "title": "Cайт для звёздного визажиста",
          "description": "Сайт реализован с более чем 15 страницами, включая фото-галерею для удобного просмотра портфолио. Проект ориентирован на высокую производительность, с результатом более 92 баллов по показателю Performance."
        },
        "project3": {
          "title": "TODO LIST",
          "description": "Проект создан на Next.js 15.1 с интеграцией Next Intl и поддержкой смены тем через куки. Для оптимизации производительности использованы memo и useMemo, что уменьшило количество ререндеров. Состояние управляется с помощью Zustand, данные сохраняются в localStorage, также добавлена фильтрация задач."
        }
      }
    },
    "experience": {
      "title": "Об опыте",
      "text1": "С 2023 года работал в веб-студии, где занимался разработкой клиентских интерфейсов для различных проектов, обеспечивая высокое качество и удобство взаимодействия. В тесном сотрудничестве с дизайнером реализовывал адаптивные проекты, точно следуя макетам в Figma. Мой основной вклад заключался в создании фронтенда, соблюдая технические требования и улучшая UX. Я также принимал активное участие в оптимизации сайта и тестировании новых функций.",
      "text2": "Для разработки адаптивных и кроссбраузерных сайтов использовал Next.js, а также внедрял креативные анимации с помощью библиотек GSAP и Motion, улучшая визуальные эффекты и взаимодействие с пользователем. Для обеспечения стабильности и масштабируемости инфраструктуры применял Docker для развертывания сайта на VPS, что позволило эффективно управлять проектами и поддерживать их работу."
    }
  },
  "TodoApp": {
    "todoList": {
      "title": "Управляй задачами легко: Вместе с ToDo",
      "addTask": {
        "title": "Мои задачи",
        "placeholder": "Добавить новую задачу...",
        "button": "Добавить"
      },
      "navTodoList": {
        "all": "Все задачи",
        "current": "Текущие",
        "completed": "Выполненные"
      },
      "taskItem": {
        "text": {
          "completed": "Выполнено",
          "notCompleted": "Выполнить"
        },
        "ariaLabels": {
          "remove": "Удалить",
          "edit": "Редактировать",
          "save": "Сохранить",
          "complete": "Выполнить / отменить"
        }
      },
      "emptyMessages": {
        "completed": "Время приступать к выполнению текущих задач, если они есть!",
        "notCompleted": "Задачи не найдены. Либо они ещё не созданы, либо вы уже всё успели выполнить!",
        "all": "Ваш список задач пока пуст. Начните с первой и шагайте к продуктивности!"
      }
    },
    "todoDocs": {
      "title": "Техническая документация: ToDo List",
      "todoDescription": {
        "title": "Описание проекта:",
        "text": "ToDo List — это приложение для управления задачами, реализованное на Next.js  с использованием App Router. Оно предоставляет интерактивный пользовательский интерфейс с фильтрацией, анимациями и локальным сохранением данных."
      },
      "todoTechnologies": {
        "title": "Используемые технологии:"
      },
      "howTodoWorks": {
        "title": "Архитектура и функциональность приложения",
        "howTodoWorksList": {
          "storage": {
            "title": "Xранилище (Zustand)",
            "descriptionList": {
              "item1": "Создание глобального состояния с использованием Zustand для централизованного управления данными.",
              "item2": "Добавление, редактирование и удаление задач с мгновенным обновлением состояния без перерендера всего списка.",
              "item3": "Разделение логического (realCompleted) и анимированного (animationCompleted) состояний для обеспечения плавных переходов и отклика интерфейса.",
              "item4": "Локальное хранилище (LocalStorage) используется для сохранения данных задач и текущих фильтров с целью восстановления состояния после перезагрузки страницы."
            }
          },
          "ui": {
            "title": "Пользовательский интерфейс",
            "descriptionList": {
              "item1": "Контролируемые компоненты для ввода данных обеспечивают валидацию и предотвращают ошибки при добавлении задач.",
              "item2": "Динамическая генерация списка задач с поддержкой адаптивного отображения и фильтрации.",
              "item3": "Сохранение текущего фильтра в LocalStorage позволяет сохранять настройки пользователя при обновлении или повторном открытии приложения.",
              "item4": "Поддержка мобильных устройств и отзывчивый дизайн для удобного использования на различных экранах.",
              "item5": "Интуитивно понятные кнопки управления задачами и фильтрацией для повышения юзабилити."
            }
          },
          "animation": {
            "title": "Анимации (Motion)",
            "descriptionList": {
              "item1": "Анимации добавления и удаления задач, улучшающие визуальное восприятие изменений в списке.",
              "item2": "Задержка в 500 мс при переключении состояния задач для обеспечения синхронного завершения анимаций и изменения логического состояния.",
              "item3": "Эффекты переходов и плавных изменений при фильтрации задач для повышения интерактивности.",
              "item4": "Использование Motion для гибкой настройки анимаций, появление и исчезновение элементов."
            }
          },
          "filter": {
            "title": "Фильтрация задач",
            "descriptionList": {
              "item1": "Динамическая фильтрация задач по состоянию (активные, выполненные, все задачи) с мгновенным откликом интерфейса.",
              "item2": "Сохранение выбранного фильтра в LocalStorage для удобства пользователя и восстановления предпочтений при повторном посещении страницы.",
              "item3": "Поддержка комбинированной фильтрации, включая поиск и сортировку по дате добавления или состоянию выполнения."
            }
          }
        }
      },
      "results": {
        "title": "Подведение итогов",
        "text": "Проект ToDo List — это современное приложение для управления задачами, построенное на Next.js с использованием Zustand, Motion и TailwindCSS.",
        "list": {
          "item1": "<bold>Гибкое управление состоянием</bold> через Zustand и сохранение данных в LocalStorage для долговечности.",
          "item2": "<bold>Плавные анимации</bold> и интерактивность с помощью Motion, улучшающие пользовательский опыт.",
          "item3": "<bold>Адаптивный и интуитивный дизайн</bold> на базе TailwindCSS для удобства на любых устройствах."
        }
      }
    }
  }
}
